app/views/slots/index.html.erb


	  <% @top_mentors.sort_by! {|mentor| mentor.slots.count}.reverse! %>
---
SELECT "slots".* FROM "slots" WHERE "slots"."mentor_id" = $1  [["mentor_id", 2]]

	    <%= mentee.first_name%>
	    <%= mentee.appointments_with_mentors.count%><br>
---
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."mentee_id" = $1  [["mentee_id", 2]]