app/views/users/show.html.erb

	<p>Upcoming pairing appointments</p>
	<% @user.appointments_with_mentors.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" INNER JOIN "slots" ON "appointments"."slot_id" = "slots"."id" WHERE "slots"."mentor_id" = $1  [["mentor_id", 1]]