app/controllers/slots_controller.rb

  def index
  	@slots = Slot.all
    @slots = @slots.order(:start_time)


  	 @top_mentors = User.all.select{|user| !user.slots.empty?}
  	 @top_mentors = @top_mentors.sort { |a,b| a.slots.inject(0){|sum, slot| sum + slot.duration_as_integer} <=> b.slots.inject(0){|sum, slot| sum + slot.duration_as_integer}}
  	 @top_mentors = @top_mentors.reverse.first(5)

  	 @top_mentees = User.all
  	 @top_mentees = @top_mentees.sort { |a,b| a.appointments_with_mentors.count <=> b.appointments_with_mentors.count }
---
SELECT "slots".* FROM "slots"
SELECT "slots".* FROM "slots" ORDER BY "slots"."start_time" ASC
SELECT  "slots".* FROM "slots" WHERE "slots"."mentor_id" = $1 ORDER BY "slots"."id" ASC LIMIT $2  [["mentor_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "slots" WHERE "slots"."mentor_id" = $1 LIMIT $2  [["mentor_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."mentee_id" = $1  [["mentee_id", 2]]

  def show
    @slot = Slot.find(params[:id])
---
SELECT  "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]

  def create
    if session[:user_id] != nil
      @slot = Slot.new(slot_params)
      @slot.mentor_id = current_user.id
      if @slot.save
---
INSERT INTO "slots" ("start_time", "date", "duration", "mentor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_time", "02:02:00"], ["date", "2017-08-17"], ["duration", "1 hour"], ["mentor_id", 7], ["created_at", "2017-09-01 03:36:16.704912"], ["updated_at", "2017-09-01 03:36:16.704912"]]